HloModule jit_convert_element_type, is_scheduled=true, entry_computation_layout={(f32[5120]{0:T(1024)})->f32[5120]{0:T(1024)}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY main.2 {
  Arg_0.1 = f32[5120]{0:T(1024)} parameter(0), metadata={op_name="args[0]"}
  ROOT copy.1 = f32[5120]{0:T(1024)} copy(Arg_0.1)
}

