HloModule jit_convert_element_type, is_scheduled=true, entry_computation_layout={(f32[]{:T(128)})->f32[]{:T(128)}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY main.2 {
  Arg_0.1 = f32[]{:T(128)} parameter(0), metadata={op_name="args[0]"}
  copy.1 = f32[]{:T(128)S(6)} copy(Arg_0.1)
  ROOT copy = f32[]{:T(128)} copy(copy.1)
}

