HloModule jit_convert_element_type, entry_computation_layout={(f32[]{:T(128)})->f32[]{:T(128)}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY main.2 {
  ROOT Arg_0.1 = f32[] parameter(0), metadata={op_name="args[0]"}
}

