HloModule jit_convert_element_type, is_scheduled=true, entry_computation_layout={(f32[4,4096,5120]{2,1,0:T(8,128)})->f32[4,4096,5120]{2,1,0:T(8,128)}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY main.2 {
  Arg_0.1 = f32[4,4096,5120]{2,1,0:T(8,128)} parameter(0), metadata={op_name="args[0]"}
  ROOT copy.1 = f32[4,4096,5120]{2,1,0:T(8,128)} copy(Arg_0.1), backend_config={"flag_configs":[],"window_config":{"kernel_window_bounds":[],"output_window_bounds":["2","12","40"],"input_window_bounds":[],"estimated_cycles":"596438","iteration_bounds":["2","43","1"]},"megacore_config":{"megacore_split_dim":"0"},"scoped_memory_configs":[],"used_scoped_memory_configs":[{"memory_space":"1","offset":"0","size":"15728640"}],"retry_config":{"retry_count":"0"}}
}

